<template>
  <div class="promotion_guild">
    <p><strong>救援金優惠說明</strong></p>
    <ul>
      <li>
        優惠次數分為二種方式
        <ul>
          <li>
            僅限一次：
            <ul>
              <li>僅可派發一次</li>
              <li>在未完成第一次派發狀況下的會員，每期仍可進行結算</li>
            </ul>
          </li>
          <li>
            多次：
            <ul>
              <li>每期皆可進行結算並派發優惠</li>
            </ul>
          </li>
        </ul>
      </li>
      <li>
        結算週期：
        <ul>
          <li>日結算：活動日期內以每日00:00:00~23:59:59範圍的資料進行統計</li>
          <li>
            週結算：以每週六結算為例
            <ul>
              <li>第一次結算為活動開始日00:00:00~下個週六23:59:59範圍的資料進行統計</li>
              <li>之後結算以週日00:00:00~週六23:59:59範圍資料統計</li>
            </ul>
          </li>
          <li>
            月結算：每月1日00:00:00結算上個月，結算範圍為上個月1日至30、31日，若為2月份則最後一天為28、29日為截止日
          </li>
        </ul>
      </li>
      <li>
        派發方式：結算後會員符合活動條件會出現於[優惠審核]頁面，代理可選擇該優惠要人工派發或自動派發優惠金額
        <ul>
          <li>自動派發：符合條件即自動新增派發優惠金額至會員錢包，標籤阻擋時不可派發</li>
          <li>人工派發：代理需在優惠審核頁面手動點選派發</li>
        </ul>
      </li>
      <li>
        阻擋派發標籤：
        <ul>
          <li>
            結算符合優惠門檻時，若會員身上有阻擋派發標籤則不會派發獎勵，且在[優惠審核列表/未派發原因]中會註記標籤阻擋
          </li>
          <li>自動派發時，若會員符合其中1個標籤，則此會員不可派發此筆優惠金額</li>
        </ul>
      </li>
      <li>綁定會員層級：會員為該層級，存款頁面才會出現此則優惠選項</li>
      <li>可開幣別：會員存款選擇的幣別符合，才會出現此則優惠選項</li>
      <li>歷史存款門檻：會員存款需達門檻才可進行結算</li>
      <li>
        負營利金額門檻：
        <ul>
          <li>固定金額：會員虧損達固定金額才可進行結算</li>
          <li>盈虧比計算： 會員結算週期內的盈虧達設定的比例才可進行結算，會員輸入數值後需補上負號</li>
        </ul>
      </li>
      <li>
        救援金計算方式：
        <ul>
          <li>固定金額：派發金額為固定金額</li>
          <li>虧損百分比計算：會員虧損金額的百分比計算</li>
        </ul>
      </li>
    </ul>
    <p><!-- notionvc: ef26648b-bb08-4e4e-8112-dceb15a57625 --></p>
    <p>※會員盈虧同[投注記錄查詢]的盈虧數值</p>
  </div>
</template>

<script lang="ts" setup>
  import { useI18n } from "vue-i18n"

  const { t } = useI18n()
</script>

<style lang="scss" scoped>
  .edit-input {
    border: 0.0625rem solid #c2c2ca;
    border-radius: 0.25rem;
    padding: 0.0313rem 0.625rem;
  }
  .promotion_guild {
    li {
      margin-bottom: 0.625rem;
    }
  }
</style>
